app/controllers/api/users_controller.rb

	def create
	  @user = User.new(user_params)
		@channel = Channel.find_by(name: "global")

	  if @user.save
		@channel.users << @user
		@user.update_attribute(:default_channel_id, @channel.id)
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "T9EIKyEcxfmsNiVrDxGZ-Q"], ["updated_at", "2020-03-03 00:19:35.657176"], ["id", 1]]