app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Cjba__LZ2ky0gCUEUa-hfg"], ["LIMIT", 1]]
---
	def current_user
		return nil unless session[:session_token]
		@current_user = User.find_by(session_token: session[:session_token])